; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_3 object type_1 type_2)
 (:predicates (pred_2 ?v1 - type_1 ?v5 - type_3)
 	      (pred_1 ?v7 - object ?v5 - type_3)
	      (pred_3 ?v1 - type_1 ?v4 - type_2)
	      (pred_4 ?v1 - type_1 ?v7 - object ?v4 - type_2))

   (:action op_1
       :parameters  (?v1 - type_1 ?v3 ?v6 - type_3)
       :precondition (and  (pred_2 ?v1 ?v3))
       :effect (and  (pred_2 ?v1 ?v6)
		     (not (pred_2 ?v1 ?v3))))

   (:action op_3
       :parameters (?v1 - type_1 ?v2 - object ?v8 - type_3 ?v4 - type_2)
       :precondition  (and  (pred_1 ?v2 ?v8) (pred_2 ?v1 ?v8) (pred_3 ?v1 ?v4))
       :effect (and (pred_4 ?v1 ?v2 ?v4)
		    (not (pred_1 ?v2 ?v8)) 
		    (not (pred_3 ?v1 ?v4))))

   (:action op_2
       :parameters (?v1 - type_1 ?v2 - object ?v8 - type_3 ?v4 - type_2)
       :precondition  (and  (pred_4 ?v1 ?v2 ?v4) (pred_2 ?v1 ?v8))
       :effect (and (pred_1 ?v2 ?v8)
		    (pred_3 ?v1 ?v4)
		    (not (pred_4 ?v1 ?v2 ?v4)))))

; problem
(define (problem gripper-2-3-3)
(:domain gripper-strips)
(:objects obj_12 obj_09 - type_1
obj_11 obj_10 obj_01 obj_06 - type_2
obj_05 obj_08 obj_04 - type_3
obj_02 obj_07 obj_03 - object)
(:init
(pred_2 obj_12 obj_04)
(pred_3 obj_12 obj_11)
(pred_3 obj_12 obj_10)
(pred_2 obj_09 obj_08)
(pred_3 obj_09 obj_01)
(pred_3 obj_09 obj_06)
(pred_1 obj_02 obj_08)
(pred_1 obj_07 obj_08)
(pred_1 obj_03 obj_04)
)
(:goal
(and
(pred_1 obj_02 obj_04)
(pred_1 obj_07 obj_04)
(pred_1 obj_03 obj_04)
)
)

(:constraints
  (and
    (always (not (and (pred_2 obj_12 obj_04) (pred_2 obj_09 obj_04))))
  )
)
)

; plan
1. (op_3 obj_09 obj_02 obj_08 obj_06)
   deleted: (pred_1 obj_02 obj_08) (pred_3 obj_09 obj_06)
   added: (pred_4 obj_09 obj_02 obj_06)
   goals met: 1 of 3
2. (op_3 obj_09 obj_07 obj_08 obj_01)
   deleted: (pred_1 obj_07 obj_08) (pred_3 obj_09 obj_01)
   added: (pred_4 obj_09 obj_07 obj_01)
   goals met: 1 of 3
3. (op_1 obj_12 obj_04 obj_05)
   deleted: (pred_2 obj_12 obj_04)
   added: (pred_2 obj_12 obj_05)
   goals met: 1 of 3
4. (op_1 obj_09 obj_08 obj_04)
   deleted: (pred_2 obj_09 obj_08)
   added: (pred_2 obj_09 obj_04)
   goals met: 1 of 3
5. (op_2 obj_09 obj_07 obj_04 obj_01)
   deleted: (pred_4 obj_09 obj_07 obj_01)
   added: (pred_1 obj_07 obj_04) (pred_3 obj_09 obj_01)
   goals met: 2 of 3
6. (op_2 obj_09 obj_02 obj_04 obj_06)
   deleted: (pred_4 obj_09 obj_02 obj_06)
   added: (pred_1 obj_02 obj_04) (pred_3 obj_09 obj_06)
   goals met: 3 of 3
